import { StrictMode } from 'react'
import { createRoot } from 'react-dom/client'
import './index.css'
import App from './App.tsx'

createRoot(document.getElementById('root')!).render(
  <StrictMode>
    <App />
  </StrictMode>,
)

// 1、以下（）不是“十五五”时期经济社会发展必须遵循的原则--坚持市场优先
// 2、提高人民生活品质，要完善（）制度体系，并畅通（）渠道--基本公共服务；社会流动
// 3、党的二十届四中全会提出，推动全体人民共同富裕要（）--稳步推进
// 4、推动新质生产力发展，必须抢占（），并推动（）深度融合--科技发展制高点；科技创新与产业创新
// 5、全会强调，‘十五五’时期经济社会发展，要坚持（）工作总基调--稳中求进
// 6、构建新发展格局的战略基点是（），关键在于增强（）--扩大内需；国内大循环内生动力和可靠性
// 7、党的二十届四中全会强调，实现社会主义现代化是一个阶梯式递进的历史过程，需要（）--不懈努力，接续奋斗
// 8、保障和改善民生要坚持尽力而为、量力而行原则，并重点加强（）民生建设--普惠性、基础性、兜底性
// 9、中国共产党第二十届中央委员会第四次全体会议于2025年10月20日至23日在北京举行。全会指出，十五五时期经济社会发展要推动经济实现（）和（），推动（）、全体人民共同富裕迈出坚实步伐--质的有效提升、量的合理增长、人的全面发展
// 10、全会提出，推进中国式现代化的根本保障是（）--党的领导
// 11、下列（）是“增强国内大循环内生动力和可靠性”的直接举措--大力提振消费，扩大有效投资
// 12、建设强大国内市场，要坚持紧密结合（），并以（）引领新供给。--惠民生与促消费；新需求
// 13、全会认为，我国发展当前处于（）的阶段--战略机遇和风险挑战并存
// 14、全会提出，到2035年人均国内生产总值达到（）水平，人民生活更加（）--中等发达国家；幸福美好
// 15、党的二十届四中全会指出，推动新质生产力发展的关键是（）--科技创新
// 16、全会提出，保障和改善民生的基本原则是（）--尽力而为、量力而行
// 17、完善收入分配制度，全会提出办好人民满意的（），并健全（）体系--教育；社会保障
// 18、公报指出，我国发展仍处于长期向好的基本趋势，这一判断的根本依据是“四个优势”更加彰显，下列不属于“四个优势”的是（）--全球资源配置权
// 19、党的二十届四中全会提出，建设美丽中国必须牢固树立的理念是（）--绿水青山就是金山银山
// 20、全会提出，推动经济高质量发展的根本动力是（）--改革创新
// 21、全会提出，现代化产业体系的骨干是（）--先进制造业
// 22、全会提出，构建现代化产业体系要坚持（）方向，并以（）为骨干--智能化、绿色化、融合化；先进制造业
// 23、加快制造强国建设，要保持制造业（），并推动传统产业（）--合理比重；优化提升
// 24、党的二十届四中全会强调，推进中国式现代化必须敢于斗争、善于斗争，勇于面对（）--风高浪急甚至惊涛骇浪的重大考验
// 25、下列关于“扩大内需”的表述，错误的是（）--要与扩大出口同步发力
// 26、推进美丽中国建设，要以（）为牵引，并协同推进（）--碳达峰碳中和；降碳、减污、扩绿、增长
// 27、下列哪项未被全会列为“十五五”时期民生建设重点（）--全面取消个人医保缴费
// 28、全会对“十五五”时期发展环境的基本判断是（）--战略机遇和风险挑战并存
// 29、加快实现建军一百年奋斗目标，要推进政治建军、改革强军、（）、人才强军、（）--科技强军；依法治军
// 30、全会高度评价了“十四五”期间的重大成就，其中不包括（）--我国已经进入中等发达国家水平
// 31、加快农业农村现代化，全会提出要把（）作为全党工作重中之重，并推动农村基本具备（）--乡村振兴；现代生活条件
// 32、推进区域协调发展，要发挥（）叠加效应，并构建（）的区域经济布局--四大战略；优势互补、高质量发展
// 33、党的二十届四中全会指出，我国长期向好的基本趋势（）--没有变
// 34、在推进中国式现代化的过程中，全会强调要推动（）区域发展战略--以上都是
// 35、全会强调，推动经济实现质的有效提升和量的合理增长，必须以（）为中心--经济建设
// 36、“十五五”时期经济社会发展的根本目的是（）--满足人民美好生活需要
// 37、全会指出，国家安全是中国式现代化（）--行稳致远的重要基础
// 38、下列（）不是全会提出的“十五五”时期生态文明建设重点--全面取消化石能源消费
// 39、全会强调，要坚决实现（），巩固拓展经济回升向好势头--全年经济社会发展目标
// 40、党的二十届四中全会提出，要增强国内大循环的（）--内生动力和可靠性